ninetyninecats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = $1, "color" = $2, "name" = $3, "sex" = $4, "description" = $5, "updated_at" = $6 WHERE "cats"."id" = $7  [["birth_date", "2018-09-04"], ["color", "orange"], ["name", "Mr. Bitey"], ["sex", "M"], ["description", "He bites!"], ["updated_at", "2018-09-11 22:45:27.458963"], ["id", 10]]
---
  def update
    @cat = Cat.find(params[:id])
    if @cat.update(cat_params)